# Напишите код, который переводит целое 
# число в строку, при том что его можно применить в любой системе счисления.
print(int('ABC',16))

##Если честно вообще не понимаю о чем речь