#Выведите первый и последний элемент списка.

list_1=list('hello world')
print(list_1[0],list_1[-1])